Revit 2027 API
CoordinationModelElementProperty.Group Property
 The name of the group of properties to which this property belongs to. E.g. Group = Identity Data.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Group { get; }
Public ReadOnly Property Group As String
	Get
public:
property String^ Group {
	String^ get ();
}
member Group : string with get
Property Value
String
Remarks
 This string is taken from the source of the Coordination Model and it's not localized in Revit. For example: If the source of the Coordination Model is in Chinese, the property group will always be in Chinese in Revit, regardless of the Revit language settings.
See Also
Reference
CoordinationModelElementProperty Class
Autodesk.Revit.DB.ExternalData Namespace